depot/app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = $1, "description" = $2, "image_url" = $3, "price" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["title", "Fancy Title 2"], ["description", "Fancy description of the book. 2"], ["image_url", "lorem2.jpg"], ["price", "299.93"], ["updated_at", "2015-10-21 20:32:30.367548"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)