depot/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Aline"], ["password_digest", "$2a$10$nWHDpwTY9JWxOLBJOPa4MesWN6KcIcc4ZM1hLSAW9cx9CdQW7SUEy"], ["created_at", "2015-10-29 05:02:18.587774"], ["updated_at", "2015-10-29 05:02:18.587774"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save