depot/app/views/carts/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
<h2>Your Cart</h2>
		<% @cart.line_items.each do |item| %>